tutorials/multiphase/interFoam/les/nozzleFlow2D/system/refineMeshDict
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2            ( 0 1 0 );
}

patchLocalCoeffs
{
    patch           outside;
    tan1            ( 1 0 0 );
}

directions      ( tan1 );

useHexTopology  no;

geometricCut    yes;

writeMesh       no;

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
